OpenFOAM/OpenFOAM-5.x/tutorials/lagrangian/reactingParcelFilmFoam/hotBoxes/0.orig/wallFilmRegion/Uf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/region0_to_"(region0_to.*)"Region_masterRegion";
    object      Uf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // cyclic boundaries between film patches
    "(cube[0-9][0-9]_side[0-9]_to_cube[0-9][0-9]_side[0-9])"
    {
        type            nonuniformTransformCyclic;
    }

    // top film surface
    "(.*top)"
    {
        type            slip;
    }

    // mapped boundaries
    "(region0_to.*)"
    {
        type            slip;
    }

    // floor sides
    walls
    {
        type            noSlip;
    }
}

// ************************************************************************* //
